HomeWork103forEDT/src/Documents/НачислениеПоОкладу/НачислениеПоОкладу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПоОкладу</name>
  <registerRecords>CalculationRegister.Зарплата</registerRecords>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

HomeWork103forEDT/src/CalculationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Зарплата</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.Календарь</schedule>
  <scheduleValue>InformationRegister.Календарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.Календарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.НачисленияУдержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

HomeWork103forEDT/src/Documents/НачислениеПоОкладу/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеПоОкладуСотрудники.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Документ.НачислениеПоОкладу.Сотрудники КАК НачислениеПоОкладуСотрудники
	|ГДЕ
	|	НачислениеПоОкладуСотрудники.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.Оклад КАК Оклад
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ВТ_Сотрудники.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	Сотрудники.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_Сотрудники КАК ВТ_Сотрудники)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.Зарплата.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.ОплатаПоОкладу;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Показатель = Выборка.Оклад;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
	Для каждого Движение Из Движения.Зарплата Цикл
		
		Отбор = Новый Структура("Регистратор, Сотрудник", Ссылка, Движение.Сотрудник);
		Норма = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор, 
		ВидПериодаРегистраРасчета.ПериодДействия)[0].РабочийДень;
		Факт = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор, 
		ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].РабочийДень;
		Оклад = Движение.Показатель;
		Движение.Сумма = ?(Норма = 0, 0, Оклад * Факт / Норма);	
		
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	
КонецПроцедуры
